       IDENTIFICATION DIVISION.
       PROGRAM-ID. CELSIUS-FAHRENHEIT.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WS-CEL PIC 99.
       01 WS-FAH PIC 999V99.

       PROCEDURE DIVISION.

           DISPLAY 'CELSIUS-FAHRENHEIT'.
           ACCEPT WS-CEL.
           DISPLAY 'CELSIUS: ' WS-CEL.
           COMPUTE WS-FAH = WS-CEL * 9.
           COMPUTE WS-FAH = WS-FAH / 5.
           COMPUTE WS-FAH = WS-FAH + 32.
           DISPLAY WS-FAH.
  
           STOP RUN.