       IDENTIFICATION DIVISION.
       PROGRAM-ID. FACTORIAL.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
         
         01 NUM PIC 9(5).
         01 REV PIC 9(5) VALUE 0.
         01 REM PIC 9.
       
       PROCEDURE DIVISION.
       
           DISPLAY 'REVERSE OF DIGITS'.
           ACCEPT NUM.
           PERFORM UNTIL NUM=0
             COMPUTE REM = FUNCTION MOD(NUM 10)
             COMPUTE REV = (REV * 10) + REM
             COMPUTE NUM = NUM / 10
             END-PERFORM.
             DISPLAY REV.
             
           
            
           
           
           STOP RUN.